{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "trainable": true, "bias": true, "nb_filter": 32, "W_constraint": null, "b_regularizer": null, "input_dtype": "float32", "border_mode": "same", "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "batch_input_shape": [null, 64, 64, 3], "nb_row": 5, "nb_col": 5, "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_1", "beta_regularizer": null, "mode": 0, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "epsilon": 1e-05}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "trainable": true, "bias": true, "nb_filter": 32, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 3, "nb_col": 3, "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_2", "beta_regularizer": null, "mode": 0, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "epsilon": 1e-05}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "trainable": true, "bias": true, "nb_filter": 32, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 3, "nb_col": 3, "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_3", "beta_regularizer": null, "mode": 0, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "epsilon": 1e-05}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 128, "name": "dense_1", "trainable": true, "b_regularizer": null, "W_constraint": null, "bias": true, "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "b_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_4", "beta_regularizer": null, "mode": 0, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "epsilon": 1e-05}}, {"class_name": "Dense", "config": {"output_dim": 1, "name": "dense_2", "trainable": true, "b_regularizer": null, "W_constraint": null, "bias": true, "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "linear", "b_constraint": null}}]}